src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыОбновленияОбъектаПриПроблемахЗаписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбновленияОбъектаПриПроблемахЗаписи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагруженСозданНовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеСоздан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагруженОбновлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагруженНеОбновлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ОтборСтатусовПроблемыПриЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоОтбора();
	ОбработатьПереданныеПараметры();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтбор

&НаКлиенте
Процедура ОтборВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Выбран = 2 Тогда
			
			ТекущиеДанные.Выбран = 0;
			
	КонецЕсли;
	
	РодительскаяСтрока = ТекущиеДанные.ПолучитьРодителя();
	
	Если РодительскаяСтрока = Неопределено Тогда
		
		УстановитьЗначениеПереключателяДляДочернихСтрок(ТекущиеДанные);
		
	Иначе
		
		ОпределитьЗначениеПереключателяДляРодительскойСтроки(РодительскаяСтрока);
		
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	УстановитьЗначениеФлагов(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	УстановитьЗначениеФлагов(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(ДанныеВозврата());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	Для Каждого ЭлементСписка Из Параметры.УстановленныеОтборы Цикл
		
		РодительскаяСтрока = РаботаСРезультатамиОбменаКлиентСервер.НайденнаяСтрокаВДанныхФормыДерево(Отбор,
		                                                                                             ЭлементСписка.Значение.Проблема,
		                                                                                             "ПроблемаСтатусЗагрузки",
		                                                                                             Ложь);
		
		Если РодительскаяСтрока <> Неопределено Тогда
			
			ПодчиненнаяСтрока = РаботаСРезультатамиОбменаКлиентСервер.НайденнаяСтрокаВДанныхФормыДерево(РодительскаяСтрока,
			                                                                                            ЭлементСписка.Значение.СтатусЗагрузки,
			                                                                                            "ПроблемаСтатусЗагрузки", 
			                                                                                            Ложь);
			
			Если ПодчиненнаяСтрока <> Неопределено Тогда
				
				ПодчиненнаяСтрока.Выбран = 1;
				
				ОпределитьЗначениеПереключателяДляРодительскойСтроки(РодительскаяСтрока)
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОтбора()
	
	ДляЗагруженныхОбъектов= Параметры.ДляЗагруженныхОбъектов;
	
	// Ошибки проведения
	СтрокаТипОшибки = Отбор.ПолучитьЭлементы().Добавить();
	
	СтрокаТипОшибки.ПроблемаСтатусЗагрузки = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроведения;
	СтрокаТипОшибки.Представление = НСтр("ru = 'Ошибка проведения'"); 
	
	Если ДляЗагруженныхОбъектов Тогда
		
		СтрокаСтатусЗагрузки = СтрокаТипОшибки.ПолучитьЭлементы().Добавить();
		
		СтрокаСтатусЗагрузки.ПроблемаСтатусЗагрузки = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый;
		СтрокаСтатусЗагрузки.Представление = НСтр("ru = 'Загружен, создан новый'");
		
		СтрокаСтатусЗагрузки = СтрокаТипОшибки.ПолучитьЭлементы().Добавить();
		
		СтрокаСтатусЗагрузки.ПроблемаСтатусЗагрузки = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженОбновлен;
		СтрокаСтатусЗагрузки.Представление = НСтр("ru = 'Загружен, обновлен существующий'");
		
	Иначе
		
		СтрокаСтатусЗагрузки = СтрокаТипОшибки.ПолучитьЭлементы().Добавить();
		
		СтрокаСтатусЗагрузки.ПроблемаСтатусЗагрузки = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
		СтрокаСтатусЗагрузки.Представление = НСтр("ru = 'Не загружен, не обновлен существующий'"); 
		
	КонецЕсли;
	
	// Запись с проверкой заполнения
	СтрокаТипОшибки = Отбор.ПолучитьЭлементы().Добавить();
	
	СтрокаТипОшибки.ПроблемаСтатусЗагрузки = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи;
	СтрокаТипОшибки.Представление = НСтр("ru = 'Ошибка записи (с проверкой заполнения)'"); 
	
	Если ДляЗагруженныхОбъектов Тогда
	
		СтрокаСтатусЗагрузки = СтрокаТипОшибки.ПолучитьЭлементы().Добавить();
		
		СтрокаСтатусЗагрузки.ПроблемаСтатусЗагрузки = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.ЗагруженСозданНовый;
		СтрокаСтатусЗагрузки.Представление = НСтр("ru = 'Загружен, создан новый'");
	
	Иначе
	
		СтрокаСтатусЗагрузки = СтрокаТипОшибки.ПолучитьЭлементы().Добавить();
		
		СтрокаСтатусЗагрузки.ПроблемаСтатусЗагрузки = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеОбновлен;
		СтрокаСтатусЗагрузки.Представление = НСтр("ru = 'Не загружен, не обновлен существующий'"); 
	
	КонецЕсли;
	
	Если Не ДляЗагруженныхОбъектов Тогда
		
		// Запись без проверки заполнения 
		СтрокаТипОшибки = Отбор.ПолучитьЭлементы().Добавить();
		
		СтрокаТипОшибки.ПроблемаСтатусЗагрузки = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи;
		СтрокаТипОшибки.Представление = НСтр("ru = 'Ошибка записи (без проверки заполнения)'"); 
		
		СтрокаСтатусЗагрузки = СтрокаТипОшибки.ПолучитьЭлементы().Добавить();
		
		СтрокаСтатусЗагрузки.ПроблемаСтатусЗагрузки = Перечисления.СтатусыОбновленияОбъектаПриПроблемахЗаписи.НеЗагруженНеСоздан;
		СтрокаСтатусЗагрузки.Представление = НСтр("ru = 'Не загружен, не создан новый'"); 
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДеревоОтбор

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеПереключателяДляДочернихСтрок(РодительскаяСтрока)

	Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		ПодчиненнаяСтрока.Выбран = РодительскаяСтрока.Выбран;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьЗначениеПереключателяДляРодительскойСтроки(РодительскаяСтрока)
	
	ЕстьЛожь   = Ложь;
	ЕстьИстина = Ложь;
	
	Для Каждого ПодчиненнаяСтрока Из РодительскаяСтрока.ПолучитьЭлементы() Цикл
		
		Если ПодчиненнаяСтрока.Выбран = 0 Тогда
			ЕстьЛожь   = Истина;
		ИначеЕсли ПодчиненнаяСтрока.Выбран = 1 Тогда
			ЕстьИстина = Истина;
		КонецЕсли;
		
		Если ЕстьИстина 
			И ЕстьЛожь Тогда
			
			РодительскаяСтрока.Выбран = 2;
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьЛожь Тогда
		РодительскаяСтрока.Выбран = 0;
	ИначеЕсли ЕстьИстина Тогда
		РодительскаяСтрока.Выбран = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеФлагов(ЗначениеФлага)

	Для Каждого СтрокаВерхнегоУровня Из Отбор.ПолучитьЭлементы() Цикл
		
		СтрокаВерхнегоУровня.Выбран = ?(ЗначениеФлага = Истина, 1, 0);
		
		УстановитьЗначениеПереключателяДляДочернихСтрок(СтрокаВерхнегоУровня);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция ДанныеВозврата()
	
	ДанныеВозврата = Новый СписокЗначений;
	
	Для Каждого СтрокаВерхнегоУровня Из Отбор.ПолучитьЭлементы() Цикл
		
		Если СтрокаВерхнегоУровня.Выбран = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПодчиненнаяСтрока Из СтрокаВерхнегоУровня.ПолучитьЭлементы() Цикл
			
			Если ПодчиненнаяСтрока.Выбран <> 1 Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеЗначенияОтбора = Новый Структура;
			ДанныеЗначенияОтбора.Вставить("Проблема",       СтрокаВерхнегоУровня.ПроблемаСтатусЗагрузки);
			ДанныеЗначенияОтбора.Вставить("СтатусЗагрузки", ПодчиненнаяСтрока.ПроблемаСтатусЗагрузки); 
			
			ДанныеВозврата.Добавить(ДанныеЗначенияОтбора, СтрШаблон("%1, %2", СтрокаВерхнегоУровня.Представление, ПодчиненнаяСтрока.Представление));
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДанныеВозврата;

КонецФункции

#КонецОбласти

#КонецОбласти
